package ru.vorobyov;

import java.util.Scanner;

public class Fifth {
    /*Дано натуральное число Т, которое представляет длительность прошедшего времени в секундах. Вывести
    данное значение длительности в часах, минутах и секундах в следующей форме:
    ННч ММмин SSc.*/
    Fifth(){
        //TODO
        /*System.out.println("Print value of seconds");
        Scanner sc = new Scanner(System.in);

        int t = sc.nextInt();
        int hh = t / 60 / 60;
        int mm = (t - hh * 60 * 60) / 60;
        int ss = t - hh * 60 * 60 - mm * 60;


        System.out.println(hh + "ч" + mm + "мин" + ss + "с");*/
    }
}
